# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import numpy as np
import pandas as pd

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [3]:
elm_lst = pd.Series(lst)
print(elm_lst)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [4]:
elm_lst.loc[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [5]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [6]:
pd.DataFrame(b)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [7]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [8]:
df = pd.DataFrame(b, columns = colnames) 
df

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

In [9]:
df.describe()

        Score_1   Score_2    Score_3    Score_4    Score_5
count  10.00000  10.00000  10.000000  10.000000  10.000000
mean   54.62000  50.11000  56.950000  47.280000  63.250000
std    25.64899  32.12204  30.168278  31.393446  24.562313
min    20.60000   0.10000   0.100000   4.200000  26.900000
25%    32.95000  29.55000  43.450000  25.050000  39.450000
50%    55.25000  40.75000  53.600000  36.400000  69.000000
75%    70.60000  72.15000  80.925000  79.300000  85.300000
max    96.60000  96.40000  96.100000  88.800000  91.800000

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [10]:
df[['Score_1','Score_3','Score_5']]

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [11]:
df['Score_3'].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [12]:
df['Score_4'].min()

4.2

### 9. From the original data frame, calculate the median Score 2 value.

In [13]:
df['Score_2'].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [14]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [15]:
orders_df = pd.DataFrame(orders)
orders_df

                          Description  Quantity  Revenue  UnitPrice
0              LUNCH BAG APPLE DESIGN         1     1.65       1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24    13.20       0.55
2         RIBBON REEL STRIPES DESIGN          1     1.65       1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880   518.40       0.18
4    PLAYING CARDS JUBILEE UNION JACK         2     2.50       1.25
5                      POPCORN HOLDER         7     5.95       0.85
6      BOX OF VINTAGE ALPHABET BLOCKS         1    11.95      11.95
7                       PARTY BUNTING         4    19.80       4.95
8            JAZZ HEARTS ADDRESS BOOK        10     1.90       0.19
9       SET OF 4 SANTA PLACE SETTINGS        48    60.00       1.25

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [16]:
sum_qtt = orders_df['Quantity'].sum()

tt_rev = orders_df['Revenue'].sum()

print(f'The total quantity ordered was {sum_qtt}. \nThe total revenue is {tt_rev}')

The total quantity ordered was 2978.
The total revenue is 637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [17]:
# Find maximum, minimum values in UnitPrice and the difference between them:
most_expensive = orders_df['UnitPrice'].max()
least_expensive = orders_df['UnitPrice'].min()
diff = most_expensive - least_expensive

# Find the Description of the value with the max and min unit price
## Frist we find the index of the row in wich the max and min values are
most_exp_row = orders_df.loc[orders_df['UnitPrice'] == most_expensive].index.item()
least_exp_row = orders_df.loc[orders_df['UnitPrice'] == least_expensive].index.item()

## Then, given the index, we find the Description of the corresponding index
most_exp_prod = orders_df.loc[most_exp_row,'Description']
least_exp_prod = orders_df.loc[least_exp_row,'Description']

## Since we letters of the strings in Description are in UPPER case, we have to title (firs letter of each 
## word in upper case and the rest in lower case)
most_exp_prod = most_exp_prod.title()
least_exp_prod = least_exp_prod.title()


# Finally we print the results, using f'strings
print (f'The most expensive order was "{most_exp_prod}" wit a unit price of {most_expensive} €.\n\
The least expensive product ordered was "{least_exp_prod}" with a unit price of {least_expensive} €.\n\
The difference between the unit price of these products is {diff} €')

The most expensive order was "Box Of Vintage Alphabet Blocks" wit a unit price of 11.95 €.
The least expensive product ordered was "World War 2 Gliders Asstd Designs" with a unit price of 0.18 €.
The difference between the unit price of these products is 11.77 €

# Import and Export Files 

# Challenge 1 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [18]:
#Your pandas import here:

import pandas as pd

In [32]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [38]:
# Your code here:

shuttle = pd.read_csv(tst_url, delimiter=' ', header=None, names = cols)

Let's verify that this worked by looking at the `head()` function.

In [39]:
# Your code here:

shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [51]:
# Your code here:

shuttle.cvs = shuttle.to_csv(r'/home/inrx/Ironhack/labs/lab-intro-pandas/your-code/shuttle.csv',index=False, header=True)

# Challenge 2 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [53]:
# Your code here:

import xlrd

astronaut = pd.read_excel(open('astronauts.xls', 'rb'))

Use the `head()` function to inspect the dataframe.

In [54]:
# Your code here:

astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [68]:
# Your code here:

astronaut["Undergraduate Major"].value_counts()

Physics                                          35
Aerospace Engineering                            33
Mechanical Engineering                           30
Aeronautical Engineering                         28
Electrical Engineering                           23
Engineering Science                              13
Engineering                                      12
Mathematics                                      11
Chemistry                                        10
Naval Sciences                                    9
Chemical Engineering                              9
Astronautical Engineering                         8
Aeronautical & Astronautical Engineering          6
Geology                                           5
Mathematics & Physics                             5
Civil Engineering                                 5
Biology                                           5
Physics & Astronomy                               4
Applied Science & Engineering                     4
Engineering Physics                               3
Aeronautics & Astronautics                        3
Computer Science                                  3
Applied Mathematics                               3
Zoology                                           2
Engineering Management                            2
Engineering Mechanics                             2
Chemistry & Biology                               2
Ocean Engineering                                 2
Education                                         2
Biological Science                                2
                                                 ..
Astronomy                                         1
Astronautics                                      1
Computer & Systems Engineering                    1
Mathematics & Statistics; Chemistry               1
Systems Engineering                               1
Industrial Management                             1
Music                                             1
Chemistry; Physiological Optics                   1
Biochemistry                                      1
Business Finance                                  1
Space Physics                                     1
Biology & Psychology                              1
Animal Science                                    1
Earth Sciences                                    1
Physics & Engineering                             1
Electrical Engineering; Computer Science          1
Psychology                                        1
Human Biology                                     1
Geosciences                                       1
Applied Biology; Mechanical Engineering           1
Industrial Engineering                            1
Economics                                         1
Accounting                                        1
Molecular Biology                                 1
Physiology                                        1
Mechanical & Aeronautical Engineering             1
Earth & Planetary Science                         1
Animal Nutrition                                  1
Business Management; Aeronautical Engineering     1
Military Science                                  1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [84]:
# Your code here:

astronaut.cvs = astronaut.to_csv(r'/home/inrx/Ironhack/labs/lab-intro-pandas/your-code/astronaut.csv',sep='\t',index=False, header=True)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [87]:
# Your code here:

cols = ['Season', 'Age', 'Childish diseases', 'Accident or serious trauma', 'High fevers in the last year',\
        'Frequency of alcohol consumption','Smoking habit', 'Number of hours spent sitting per day', 'Output']
database = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt'

fertility = pd.read_csv(database, delimiter=',', header=None, names = cols, index_col=False)

In [88]:
fertility.head()

,Season,Age,Childish diseases,Accident or serious trauma,High fevers in the last year,Frequency of alcohol consumption,Smoking habit,Number of hours spent sitting per day,Output
0,-0.33,0.69,0,1,1,0,0.8,0,0.88
1,-0.33,0.94,1,0,1,0,0.8,1,0.31
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50